app/Controllers/Auth.php

    public function doLogin()
    {


        $userModel = new \App\Models\UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('pwd');

        // Vérification des identifiants
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'user1@gmail.com'
 LIMIT 1