app/Controllers/Home.php

INSERT INTO `users` (`username`, `email`, `pwd`, `created_at`, `updated_at`) VALUES ('user1', 'user1@gmail.com', 'user1', '2025-06-13 08:28:01', '2025-06-13 08:28:01')
---
    public function inscriptionPost()
    {
        $userModel = new \App\Models\UserModel();

        $data = [
            'username'    => $this->request->getPost('username'),
            'email'           => $this->request->getPost('email'),
            'pwd'          => $this->request->getPost('pwd'),
        ];
        try {
            $userModel->insert($data);

SELECT *
FROM `tasks`
WHERE `user_id` = '1'
---
    public function accueil()
    {
        $tasks = new TaskModel();
        // Vérification de la session
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter pour accéder à cette page.');
        }


        $data['tasks'] = $tasks->where('user_id', session()->get('user_id'))->findAll();

INSERT INTO `tasks` (`user_id`, `title`, `description`, `category`, `priority`, `status`, `dueDate`, `created_at`, `updated_at`) VALUES ('1', 'Finir devoir math', 'Finir devoir math', 'Personnel', 'low', 'en cours', '2025-06-14', '2025-06-14 05:25:30', '2025-06-14 05:25:30')
---
    public function retrieving_new_task()
    {
            $taskModel = new TaskModel();

            // Récupération des données POST
            $data = [
                'user_id'     => session('user_id'), // supposé que tu utilises les sessions
                'title'       => $this->request->getPost('title'),
                'description' => $this->request->getPost('description'),
                'category'    => $this->request->getPost('category'),
                'priority'    => $this->request->getPost('priority'),
                'status'      => 'en cours', // ou autre valeur par défaut
                'dueDate'    => $this->request->getPost('due_date'),

                'created_at'  => date('Y-m-d H:i:s'),
            ];

            // Insertion dans la base de données
            if ($taskModel->insert($data)) {

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '6'
DELETE FROM `tasks`
WHERE `id` IN ('6')
---
    public function delete_task()
    {
        $taskModel = new TaskModel();
        $taskId = $this->request->getPost('task_id');

        // Vérification de l'existence de la tâche
        if ($taskModel->find($taskId)) {
            // Suppression de la tâche
            if ($taskModel->delete($taskId)) {

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '11'
UPDATE `tasks` SET `status` = 'terminée', `updated_at` = '2025-06-13 20:03:53'
WHERE `tasks`.`id` IN ('11')
---
    public function change_task_status()
    {

        $taskModel = new TaskModel();
        $taskId = $this->request->getPost('task_id');
        $newStatus = $this->request->getPost('status');

        // Vérification de l'existence de la tâche
        if ($taskModel->find($taskId)) {
            // Mise à jour du statut de la tâche
            if ($taskModel->update($taskId, ['status' => $newStatus])) {